name: "pp_v4_det"
platform: "onnxruntime_onnx"  # 表明使用 ONNX 模型
max_batch_size: 1  # 或者根据实际情况设置批次大小

input [
  {
    name: "x"  # 输入名称
    data_type: TYPE_FP32  # 根据模型的实际数据类型进行选择
    dims: [3, -1, -1]  # 动态维度，-1表示该维度为动态
  }
]

output [
  {
    name: "sigmoid_11.tmp_0"  # 输出名称
    data_type: TYPE_FP32  # 根据模型的实际数据类型进行选择
    dims: [1, -1, -1]  # 动态维度，-1表示该维度为动态
  }
]

instance_group [
  {
    kind: KIND_GPU  # 或 KIND_CPU，取决于你部署的设备
    count: 1  # 设置使用的实例数，具体数量根据实际情况调整
  }
]

